<template>
  <v-dialog
    :value="isShownTerms"
    max-width="1200"
    @click:outside="hundleCloseTermsDialog"
    @input="$emit('input', $event.target.isShownTerms)"
  >
    <v-card color="brown lighten-5" class="term-font">
      <div class="container mx-auto my-4 term-font px-10 lg:px-60 lg:py-20">
        <div class="text-center text-4xl font-bold my-10">利用規約</div>
        <div class="grid grid-rows-1">
          <div class="text-2xl font-bold mt-10 mb-5">利用規約</div>
          <p>
            この利用規約（以下，「本規約」といいます。）は，プロフちゃん（以下，「当事務局」といいます。）がこのウェブサイト上で提供するサービス（以下，「本サービス」といいます。）の利用条件を定めるものです。登録ユーザーの皆さま（以下，「ユーザー」といいます。）には，本規約に従って，本サービスをご利用いただきます。
          </p>
          <div class="text-2xl font-bold mt-10 mb-5">第1条（適用）</div>
          <ol class="ml-5 list-decimal">
            <li>
              本規約は，ユーザーと当事務局との間の本サービスの利用に関わる一切の関係に適用されるものとします。
            </li>
            <li>
              当事務局は本サービスに関し，本規約のほか，ご利用にあたってのルール等，各種の定め（以下，「個別規定」といいます。）をすることがあります。これら個別規定はその名称のいかんに関わらず，本規約の一部を構成するものとします。
            </li>
            <li>
              本規約の規定が前条の個別規定の規定と矛盾する場合には，個別規定において特段の定めなき限り，個別規定の規定が優先されるものとします。
            </li>
          </ol>
          <div class="text-2xl font-bold mt-10 mb-5">第2条（利用登録）</div>
          <ol class="ml-5 list-decimal">
            <li>
              本サービスにおいては，登録希望者が本規約に同意の上，当事務局の定める方法によって利用登録を申請し，当事務局がこれを承認することによって，利用登録が完了するものとします。
            </li>
            <li>
              当事務局は，利用登録の申請者に以下の事由があると判断した場合，利用登録の申請を承認しないことがあり，その理由については一切の開示義務を負わないものとします。
              <ol class="ml-5 list-decimal">
                <li>利用登録の申請に際して虚偽の事項を届け出た場合</li>
                <li>本規約に違反したことがある者からの申請である場合</li>
                <li>その他，当事務局が利用登録を相当でないと判断した場合</li>
              </ol>
            </li>
          </ol>
          <div class="text-2xl font-bold mt-10 mb-5">
            第3条（ユーザーIDおよびパスワードの管理）
          </div>
          <ol class="ml-5 list-decimal">
            <li>
              ユーザーは，自己の責任において，本サービスのユーザーIDおよびパスワードを適切に管理するものとします。
            </li>
            <li>
              ユーザーは，いかなる場合にも，ユーザーIDおよびパスワードを第三者に譲渡または貸与し，もしくは第三者と共用することはできません。当事務局は，ユーザーIDとパスワードの組み合わせが登録情報と一致してログインされた場合には，そのユーザーIDを登録しているユーザー自身による利用とみなします。
            </li>
            <li>
              ユーザーID及びパスワードが第三者によって使用されたことによって生じた損害は，当事務局に故意又は重大な過失がある場合を除き，当事務局は一切の責任を負わないものとします。
            </li>
          </ol>
          <div class="text-2xl font-bold mt-10 mb-5">
            第4条（データの取り扱い）
          </div>
          <ol class="ml-5 list-decimal">
            <li>
              登録ユーザーは、保存データにつき所有権を有します。お客様は、本サービス等を利用することで、保存データに関し当事務局による管理及び取扱いを委託したものとします。
            </li>
            <li>
              当事務局は、登録ユーザーの承諾を得ることなく、サーバの故障・停止時の復旧の便宜に備えて保存データを任意でバックアップできるものとします。
            </li>
            <li>
              当事務局は、サービス利用契約の終了に伴い、全ての保存データを削除します。当事務局は、サービス利用契約終了後、保存データについて、その保管、削除、バックアップ等に関して登録ユーザー又は第三者に生じた損害につき一切の責任を負いません。
            </li>
            <li>
              当事務局は、保存データを善良な管理者の注意を持って管理し、本条その他において別段の定めがある場合を除き、登録ユーザーの書面による承諾を得ることなく、本規約に定める以外の目的のために利用あるいは複製し、又は第三者に利用させ、
              若しくは開示、漏洩いたしません。
            </li>
            <li>
              当事務局は、保存データを次の目的のために利用することができます。
              <ol class="ml-5 list-decimal">
                <li>
                  本サービス等の提供、改善、機能の追加・削減・修正、管理、運営等のため
                </li>
                <li>
                  登録ユーザーが本サービス等をご利用するにあたり必要な連絡をするため
                </li>
                <li>
                  当事務局が運営する他の事業・サービス等の提供、改善、管理、運営等のため
                </li>
              </ol>
            </li>
            <li>
              当事務局は、ユーザーの本サービス等のご利用を通じて行われた行動に関する情報（以下「利用状況データ」といいます。)を取得し、次に定める本サービス等の機能向上、開発の目的のために解析し、利用することができるものとします。
              <ol class="ml-5 list-decimal">
                <li>
                  本サービス等の提供・改善・管理・運営・機能の追加・削減・修正等のため
                </li>
                <li>OS のバージョンその他の推奨利用環境を決定するため</li>
                <li>表示速度等パフォーマンスの改善のため</li>
              </ol>
            </li>
            <li>
              当事務局は、利用状況データの取得・解析のために Google Analytics
              その他の第三者が提供する情報収集モジュール（以下「情報収集モジュール」といいます。）を利用する場合があります。情報収集モジュールでは、cookie(クッキー)及びモバイルデバイスの識別情報(Android
              の広告識別子、iOS の広告
              識別子等)を使用し、個人を特定する情報を含むことなく、利用状況データを収集することがあります。収集された利用状況データは、当該情報収集モジュールを提供する第三者の定めるプライバシーポリシーに基づき管理されています。当事務局は、情報収集モジュールの利用によるお客様の損害について責任を負わないものとします。
            </li>
            <li>
              当事務局は、
              本プラットフォームから、ユーザーが当該プラットフォームに保存したデータ(本プラットフォーム上のアカウント情報、アカウント及びチャンネル等に登録されたメンバー情報、アカウント及びチャンネル等に投稿された内容及びアクティビティログ等を含みます。以下「プラットフォームデータ」といいます。)の提供を受ける場合があり、本サービス等の提供・改善・管理・運営・機能の追加・削減・修正等のため、プラットフォームデータを利用することができるものとします。この場合、当事務局は、当該プラットフォームの定める利用規約及びプライバシーポリシー等に従い、適正に提供を受けるものとします。
            </li>
            <li>
              当事務局は、以下の場合、保存データ、利用状況データ又はプラットフォームデータを第三者に開示、公開することがあります。
              <ol class="ml-5 list-decimal">
                <li>
                  法令に従った要請(捜査関係事項照会書による要請を含む)や法令の手続き上必要とされる場合、又は当事務局、他の登録ユーザー若しくは第三者の権利を保護するために必要な場合等であると当事務局が判断した場合
                </li>
                <li>
                  当事務局が本サービス等の広告、宣伝の目的で登録ユーザーの名称及びロゴマーク等を利用する場合(なお、利用について事前に承諾を得るものとし、開示内容やロゴマークの表示方法について登録ユーザーより指示があった場合、当事務局はその指示に従います。)
                </li>
              </ol>
            </li>
            <li>
              サービス利用契約が終了した場合、保存データ、利用状況データ及びプラットフォームデータの取扱いについては、法令に反しない限りにおいて、当事務局がその裁量により決することができるものとします。
            </li>
          </ol>
          <div class="text-2xl font-bold mt-10 mb-5">第5条（禁止事項）</div>
          <div class="mb-3">
            ユーザーは，本サービスの利用にあたり，以下の行為をしてはなりません。
          </div>
          <ol class="ml-5 list-decimal">
            <li>法令または公序良俗に違反する行為</li>
            <li>犯罪行為に関連する行為</li>
            <li>
              本サービスの内容等，本サービスに含まれる著作権，商標権ほか知的財産権を侵害する行為
            </li>
            <li>
              当事務局，ほかのユーザー，またはその他第三者のサーバーまたはネットワークの機能を破壊したり，妨害したりする行為
            </li>
            <li>当事務局のサービスの運営を妨害するおそれのある行為</li>
            <li>不正アクセスをし，またはこれを試みる行為</li>
            <li>他のユーザーに関する個人情報等を収集または蓄積する行為</li>
            <li>不正な目的を持って本サービスを利用する行為</li>
            <li>
              本サービスの他のユーザーまたはその他の第三者に不利益，損害，不快感を与える行為
            </li>
            <li>他のユーザーに成りすます行為</li>
            <li>
              当事務局のサービスに関連して，反社会的勢力に対して直接または間接に利益を供与する行為
            </li>
            <li>その他，当事務局が不適切と判断する行為</li>
          </ol>
          <div class="text-2xl font-bold mt-10 mb-5">
            第6条（本サービスの提供の停止等）
          </div>
          <ol class="ml-5 list-decimal">
            <li>
              当事務局は，以下のいずれかの事由があると判断した場合，ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。
              <ol class="ml-5 list-decimal">
                <li>
                  本サービスにかかるコンピュータシステムの保守点検または更新を行う場合
                </li>
                <li>
                  地震，落雷，火災，停電または天災などの不可抗力により，本サービスの提供が困難となった場合
                </li>
                <li>コンピュータまたは通信回線等が事故により停止した場合</li>
                <li>その他，当事務局が本サービスの提供が困難と判断した場合</li>
              </ol>
            </li>
            <li>
              当事務局は，本サービスの提供の停止または中断により，ユーザーまたは第三者が被ったいかなる不利益または損害についても，一切の責任を負わないものとします。
            </li>
          </ol>
          <div class="text-2xl font-bold mt-10 mb-5">
            第7条（利用制限および登録抹消）
          </div>
          <ol class="ml-5 list-decimal">
            <li>
              当事務局は，ユーザーが以下のいずれかに該当する場合には，事前の通知なく，ユーザーに対して，本サービスの全部もしくは一部の利用を制限し，またはユーザーとしての登録を抹消することができるものとします。
              <ol class="ml-5 list-decimal">
                <li>本規約のいずれかの条項に違反した場合</li>
                <li>登録事項に虚偽の事実があることが判明した場合</li>
                <li>当事務局からの連絡に対し，一定期間返答がない場合</li>
                <li>
                  本サービスについて，最終の利用から一定期間利用がない場合
                </li>
                <li>
                  その他，当事務局が本サービスの利用を適当でないと判断した場合
                </li>
              </ol>
            </li>
            <li>
              当事務局は，本条に基づき当事務局が行った行為によりユーザーに生じた損害について，一切の責任を負いません。
            </li>
          </ol>
          <div class="text-2xl font-bold mt-10 mb-5">第8条（退会）</div>
          <p>
            ユーザーは，当事務局の定める退会手続により，本サービスから退会できるものとします。
          </p>
          <div class="text-2xl font-bold mt-10 mb-5">
            第9条（保証の否認および免責事項）
          </div>
          <ol class="ml-5 list-decimal">
            <li>
              当事務局は，本サービスに事実上または法律上の瑕疵（安全性，信頼性，正確性，完全性，有効性，特定の目的への適合性，セキュリティなどに関する欠陥，エラーやバグ，権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。
            </li>
            <li>
              当事務局は，本サービスに起因してユーザーに生じたあらゆる損害について一切の責任を負いません。ただし，本サービスに関する当事務局とユーザーとの間の契約（本規約を含みます。）が消費者契約法に定める消費者契約となる場合，この免責規定は適用されません。
            </li>
            <li>
              前項ただし書に定める場合であっても，当事務局は，当事務局の過失（重過失を除きます。）による債務不履行または不法行為によりユーザーに生じた損害のうち特別な事情から生じた損害（当事務局またはユーザーが損害発生につき予見し，または予見し得た場合を含みます。）について一切の責任を負いません。また，当事務局の過失（重過失を除きます。）による債務不履行または不法行為によりユーザーに生じた損害の賠償は，ユーザーから当該損害が発生した月に受領した利用料の額を上限とします。
            </li>
            <li>
              当事務局は，本サービスに関して，ユーザーと他のユーザーまたは第三者との間において生じた取引，連絡または紛争等について一切責任を負いません。
            </li>
          </ol>
          <div class="text-2xl font-bold mt-10 mb-5">
            第10条（本サービス等の内容の変更、終了）
          </div>
          <ol class="ml-5 list-decimal">
            <li>
              当事務局は、当事務局の都合により、本サービス等の内容を変更し、または提供を終了することができます。
            </li>
            <li>
              当事務局が本サービス等の提供を終了する場合、当事務局はユーザーに事前に通知するものとします。
            </li>
            <li>
              本規約の他の条項の定めにかかわらず、本条第１項に基づく措置によりユーザーに損害又は不利益が生じたとしても、当事務局は何らその責任を負わないものとします。
            </li>
          </ol>
          <div class="text-2xl font-bold mt-10 mb-5">
            第11条（サービス内容の変更等）
          </div>
          <p>
            当事務局は，ユーザーに通知することなく，本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし，これによってユーザーに生じた損害について一切の責任を負いません。
          </p>
          <div class="text-2xl font-bold mt-10 mb-5">
            第12条（利用規約の変更）
          </div>
          <p>
            当事務局は，必要と判断した場合には，ユーザーに通知することなくいつでも本規約を変更することができるものとします。なお，本規約の変更後，本サービスの利用を開始した場合には，当該ユーザーは変更後の規約に同意したものとみなします。
          </p>
          <div class="text-2xl font-bold mt-10 mb-5">
            第13条（個人情報の取扱い）
          </div>
          <ol class="ml-5 list-decimal">
            <li>
              本サービスに関する個人情報の取扱いについては、別途当事務局が本サービスに関し定めるプライバシーポリシーの定めによるものとし、ユーザーはこのプライバシーポリシーに従って当事務局が個人情報を取扱うことについて同意するものとします。
            </li>
            <li>
              ユーザーは、以下の事項が真実であることを表明及び保証し、かかる表明及び保証が真実でなかった場合には、ユーザーはそれにより当事務局が被った損害を賠償するものとします。
              <ol class="ml-5 list-decimal">
                <li>
                  ユーザーから当事務局に対する個人情報の開示又は提供が適法であること(特に、要配慮個人情報又はこれに類する不当な差別に繋がりうるデータを保存する場合は、情報主体の同意を得ていること。)
                </li>
                <li>
                  個人情報を当事務局がユーザーから委託された業務において使用することが適法であること
                </li>
                <li>
                  個人情報に特定個人情報(「行政手続における特定の個人を識別するための番号の利用等に関する法律」第2条第8項に定めるものを意味します。)が含まれないこと
                </li>
              </ol>
            </li>
          </ol>
          <div class="text-2xl font-bold mt-10 mb-5">
            第14条（通知または連絡）
          </div>
          <p>
            ユーザーと当事務局との間の通知または連絡は，
            当事務局の定める方法によって行うものとします。当事務局は,
            ユーザーから, 当事務局が別途定める方式に従った変更届け出がない限り,
            現在登録されている連絡先が有効なものとみなして当該連絡先へ通知または連絡を行い,
            これらは, 発信時にユーザーへ到達したものとみなします。
          </p>
          <div class="text-2xl font-bold mt-10 mb-5">
            第15条（権利義務の譲渡の禁止）
          </div>
          <p>
            ユーザーは，当事務局の書面による事前の承諾なく，利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し，または担保に供することはできません。
          </p>
          <div class="text-2xl font-bold mt-10 mb-5">
            第16条（準拠法・裁判管轄）
          </div>
          <ol class="ml-5 list-decimal">
            <li>本規約の解釈にあたっては，日本法を準拠法とします。</li>
            <li>
              本サービスに関して紛争が生じた場合には，当事務局の本店所在地を管轄する裁判所を専属的合意管轄とします。
            </li>
          </ol>
          <div class="my-20 text-center">以上</div>
        </div>
      </div>
    </v-card>
  </v-dialog>
</template>

<script>
export default {
  props: {
    isShownTerms: {
      type: Boolean,
      required: true,
      default: false,
    },
  },
  methods: {
    hundleCloseTermsDialog() {
      this.$emit("close-terms-dialog");
    },
  },
};
</script>
